andrjus/omega-avatar-rev.1/content/app/central/source/platform/waveshare-stm32f407/avatar-central-perephery.cpp
extern "C"{
#include "avatar-central-common.h"
}
#include "jsonsl.h"
#include "avatar-central.hpp"
#include "main.h"
#include "stm32f4xx_hal.h"
#include "gpio.h"
#include "usart.h"
#include "can.h"
#include "stm32f4xx_hal.h"
#include "ff.h"
#include "fatfs.h"
#include "fsmc.h"
#include "tim.h"
#include "usbd_cdc_if.h"
#include "lwip.h"
#include "stm32_bsp_nand.h"
#include "lwip/apps/tftp_server.h"
#include "net/robosd_net_master.hpp"
#include "core/robosd_system.hpp"
#include "core/robosd_log.hpp"
#include "core/robosd_ini_parser.h"
#include "core/robosd_app.hpp"
#include "core/robosd_backend.hpp"
#include "core/robosd_ring_buf.hpp"
#ifdef RIGHT_HAND
#define AVATAR_INI_FILE "right_hand.ini"
#endif
#ifdef LEFT_HAND
#define AVATAR_INI_FILE "left_hand.ini"
#endif
bool nand_file_system_mount(void);
class dynamixel_UART4 ;
class dynamixel_UART5 ;
bool nand_file_system_build_(void);
void command_poll(void);
enum {transport_buffers_count_shift =5, transport_buffers_count=1<<transport_buffers_count_shift};
struct transport_buffer{
	uint8_t memo[32];
	int  space=0;
} transport_buffers[transport_buffers_count];

robo::ring_t< transport_buffers_count_shift,transport_buffer *> transport_buffers_pool_;
robo::ring_t< transport_buffers_count_shift,transport_buffer *> transport_buffers_queue_;
enum{ UART3_BUFFER_SIZE=1048};
uint8_t UART3_BUFFER[UART3_BUFFER_SIZE];
uint8_t UART3_TX_BUFFER[UART3_BUFFER_SIZE];
uint8_t * pUART3_BUFFER = UART3_BUFFER;
uint8_t  tmp_uart;
size_t  UART3_BUFFER_COUNT = 0;
size_t UART3_ACTUAL_SIZE=0;
void transport_poll(void);
transport_buffer * transport_buffer_query(void){
	if( robo::system::env::is_frontend() ){
		int cnt = 0;
		do{
			{
				robo::system::guard g__;
				cnt = transport_buffers_pool_.count();
			}
			if  ( __get_PRIMASK() && NVIC_GetPendingIRQ (OTG_FS_IRQn) ){
				HAL_PCD_IRQHandler(&hpcd_USB_OTG_FS);
			}
			transport_poll();
		} while(cnt<1);
	} 
	robo::system::guard g__;
	if(transport_buffers_pool_.count()>0){
		transport_buffer * ret = transport_buffers_pool_.get();
		if(ret){
			ret->space=32;
		}
		return ret;
	} else {
		
		return nullptr;
	}
}

void transport_buffer_release(transport_buffer * _buffer){
	robo::system::guard g__;
	if(transport_buffers_pool_.space()>0){
		transport_buffers_pool_.put(_buffer);
	}
}
transport_buffer * transport_buffer_pop(void){
	robo::system::guard g__;
	if(transport_buffers_queue_.count()>0){
		return transport_buffers_queue_.get();
	} else {
		return nullptr;
	}
}
void transport_buffer_push(transport_buffer * _buffer){
	robo::system::guard g__;
	if(transport_buffers_queue_.space()>0){
		transport_buffers_queue_.put(_buffer);
	}
}
void transport_poll(void){
			static transport_buffer * current_packet = nullptr;
		if(current_packet == nullptr){
			current_packet = transport_buffer_pop();	
		}
		if(current_packet){
			if( CDC_Transmit_FS( current_packet->memo, 32-current_packet->space) == 0){
				transport_buffer_release(current_packet);
				current_packet = nullptr;
			}
		}
}
#if ROBO_UNICODE_ENABLED == 1
#include <wchar.h>
#endif
#define PERSISTENT_INI 1

#if  PERSISTENT_INI == 0
bool build_default_ini_(void);
#endif

bool tftp_init_(void);
void CAN1_configure_filter(void);

struct ican_wait {
	uint16_t id = 0xff;
	uint16_t count = 0;
	uint8_t dummy[8];
	uint8_t * data = dummy;	
	void reset( void ){
		id = 0xFF;
		count = 0;
		data = dummy;
	}
} can_wait;


void avatar::CAN_channel::send(const uint8_t * _data, unsigned int _count){
	if(_count>=2){
		can_wait.reset();
		CAN_TxHeaderTypeDef header;
		header.DLC =_count-2;
		header.ExtId = 0;
		header.IDE = CAN_ID_STD;
		header.RTR = CAN_RTR_DATA;
		header.StdId = *((uint16_t *)_data);
		if( HAL_CAN_AddTxMessage(&hcan1, &header, const_cast<uint8_t *>(_data + 2 ), (uint32_t *)CAN_TX_MAILBOX0) != HAL_OK ) {
			avatar::CAN_channel::refuse();			
		}
	}
}



void avatar::CAN_channel::receive(uint8_t * _data, unsigned int _count){
	if( _count>=2){
		can_wait.id = *((uint16_t *)_data);
		can_wait.count = _count-2;
		can_wait.data = _data+2;
	}
}


void avatar::dynamixel_rs485_channel::send_cancel(void){
	HAL_UART_DMAStop(&huart5);
}

void avatar::dynamixel_rs485_channel::receive_cancel(void){
	HAL_UART_DMAStop(&huart5);
}
		

void avatar::dynamixel_rs485_channel::send(const uint8_t * _data, unsigned int _count){
	HAL_HalfDuplex_EnableTransmitter(&huart5);
	HAL_GPIO_WritePin(RE_DE_485_GPIO_Port,RE_DE_485_Pin,GPIO_PIN_SET);
	HAL_UART_Transmit_DMA(&huart5,const_cast<uint8_t *>(_data),_count) ;
}
		
void avatar::dynamixel_rs485_channel::receive(uint8_t * _data, unsigned int _count){
	HAL_UART_Receive_DMA(&huart5,_data,_count);
	HAL_GPIO_WritePin(RE_DE_485_GPIO_Port,RE_DE_485_Pin,GPIO_PIN_RESET);
	HAL_HalfDuplex_EnableReceiver(&huart5);
}


void avatar::dynamixel_TTL_channel::send_cancel(void){
	HAL_UART_DMAStop(&huart4);
}

void avatar::dynamixel_TTL_channel::receive_cancel(void){
	HAL_UART_DMAStop(&huart4);
}
		

void avatar::dynamixel_TTL_channel::send(const uint8_t * _data, unsigned int _count){
		HAL_GPIO_WritePin(TX_EN_DYNAMIXEL_GPIO_Port,TX_EN_DYNAMIXEL_Pin,GPIO_PIN_SET);
		HAL_UART_Transmit_DMA(&huart4,const_cast<uint8_t *>(_data),_count) ;
}
		
void avatar::dynamixel_TTL_channel::receive(uint8_t * _data, unsigned int _count){
		HAL_GPIO_WritePin(TX_EN_DYNAMIXEL_GPIO_Port,TX_EN_DYNAMIXEL_Pin,GPIO_PIN_RESET);
		HAL_UART_Receive_DMA(&huart4,_data,_count);
}


namespace robo {
	bool system::env::begin(void) {
		//todo только первый раз
		//nand_file_system_build_();

		ROBO_LBREAKN(nand_file_system_mount());

		ROBO_LBREAKN(tftp_init_());
		
		#if  PERSISTENT_INI == 0
		ROBO_LBREAKN(build_default_ini_() );
		#endif
		
		return true;
	}
		
	void system::env::finish(void) {
	}

	#if ROBO_APP_ENV_TYPE == ROBO_APP_TYPE_KEIL

	time_us_t period_us_ = 1000;
	time_us_t us_ = 0;
	time_ms_t ms_ = 0;
	time_us_t us_acc_ = 0;
	void tick(void){
		us_+=period_us_;
		us_acc_+=period_us_;
		if(us_acc_>=1000){
			us_acc_-=1000;
			ms_++;
		}
	}

	void  system::env::abort(void) {
		::abort();
	}
	
	bool system::env::start(void) {
		HAL_CAN_ActivateNotification(&hcan1, CAN_IT_RX_FIFO0_MSG_PENDING | CAN_IT_TX_MAILBOX_EMPTY );
		CAN1_configure_filter();
		HAL_CAN_Start(&hcan1);

