andrjus/omega-avatar-rev.1/content/app/central/source/platform/waveshare-stm32f407/avatar-central-perephery.cpp
		HAL_TIM_Base_Start_IT(&htim7);
		
		//HAL_UARTEx_ReceiveToIdle_DMA(&huart3, UART3_BUFFER, UART3_BUFFER_SIZE);
		UART_Start_Receive_IT(&huart3,&tmp_uart,1);
		return true;
	}

	void system::env::stop(void) {
	}

	result system::env::startup(void) {
		return result::complete;
	}
	
	result system::env::shutdown(void) {
		return result::complete;
	}

	void system::env::frontend_loop(void) {
		MX_LWIP_Process();
		command_poll();
	}
	
	void system::env::backend_loop(void) {
		tick();
	}

	void * system::env::critical_enter(void) {
		return nullptr;
	}
	
	void system::env::critical_leave(void * /*context_*/) {
	}
	
		system::context current_context_ = system::context::frontend;
	int locked_ = 0;
	

	bool system::env::is_frontend(void) {
		return current_context_==context::frontend;
	}

	bool system::env::is_backend(void) {
		return current_context_==context::backend;
	}
	

	void* system::env::enter(void) {
		uint32_t prim = __get_PRIMASK();
		__disable_irq();
		return (void *) prim;
		
	}
	
	void system::env::leave(void* _context) {
		int32_t prim = (uint32_t)_context;
		if(!prim) 
			__enable_irq();
	}
	

	void system::env::lock(void) {
		__disable_irq();
		ROBO_APP_ASSERT(locked_ == false);			
		locked_ = true;
	}
	void system::env::unlock(void) {
		ROBO_APP_ASSERT(locked_ == true);			
		locked_ = false;
		__enable_irq();
	}
	

	void system::env::fall(void) {
		ROBO_APP_ASSERT(current_context_==context::frontend);
		current_context_=context::backend;
	}
	
	void system::env::comeback(void) {
		ROBO_APP_ASSERT(current_context_==context::backend);
		current_context_=context::frontend;
	}
	
	time_us_t system::env::time_us(void) {
		return us_;
	}
	
	time_us_t system::env::realtime_us(void) {
		return us_;
	}
	
	time_ms_t system::env::time_ms(void) {			
		return ms_;
	}
	
	random_t system::env::rand(random_t _max) {
		return SysTick->VAL % _max;
	}
	
	void system::env::wakeup(void) {
		NVIC_SetPendingIRQ(TIM7_IRQn);
	}
	
	time_us_t system::env::period_us(void) {
		return period_us_;
	}
	
	void system::env::sleep(void) {
	}
	
	
	void system::env::print( cstr  _s){
		
		transport_buffer * packet = transport_buffer_query();
		while (packet)	{
			uint8_t * ptr = packet->memo;
			while(*_s && packet->space > 0){
				*ptr++ = (uint8_t)*_s++;
				packet->space--;
			}
			if( packet->space == 0){
				transport_buffer_push(packet);
				if(*_s==0){
					return;
				}
			}
			else{
				if(*_s==0){
					transport_buffer_push(packet);
					return;
				}
			}
			packet = transport_buffer_query();						
		}	
		
		/*while(*_s){
			huart3.Instance->DR = *_s++;
			while ( (huart3.Instance->SR & (UART_FLAG_TC)) != (UART_FLAG_TC) );
		}*/
		
	}
	
#if ROBO_APP_ALLOC_ENABLED == 1
	void* system::env::mem_alloc(size_t _size) {
		return malloc(_size);
	}
	void system::env::mem_free(void * _memo) {
		free(_memo);
	}
#endif

	size_t system::env::sprintf(char_t* _dst, size_t _max_sz, cstr _format, va_list _args) {

	#if ROBO_UNICODE_ENABLED == 1
			//size_t sz = vswprintf(_dst, _max_sz, _format, _args);
		size_t sz = vswprintf(_dst, _max_sz, _format, _args);
	#else
			size_t sz = vsprintf(_dst, _format, _args);
	#endif
			if (sz < _max_sz-1) {
				_dst[sz] = 0;
			}
			return sz;

		}
#endif
	#if ROBO_APP_INI_TYPE == ROBO_APP_TYPE_NATIVE	
	cstr g_robo_ini_fn = nullptr;
	bool system::ini::begin(cstr _ini) {
		g_robo_ini_fn = _ini;
		FIL testFile;
		size_t bytesread;
		char * buf = new char [4000];
		f_open(&testFile, g_robo_ini_fn, FA_READ);
		f_read (&testFile,buf, 4000,&bytesread);
		robo_ipa_init(ROBO_IPA_NORMAL);
		robo_ipa_applay(buf, bytesread);
		delete [] buf;
		f_close(&testFile);
		return true;
	}
	
	void system::ini::finish(void) {
		g_robo_ini_fn = nullptr;
	}
	
	bool system::ini::load_str(char_t* _dst, size_t _max_sz, cstr _section, cstr _key) {
		ROBO_LBREAKN_F(g_robo_ini_fn!=nullptr, "ini is't initialized")
		robo::robo_ipa_string_get(_section, _key, "", _dst, _max_sz);

		return true;
	}

#endif
}

void  CAN1_configure_filter( void ){
	CAN_FilterTypeDef canFilterConfig={0};
		for(int i=0;i<13;i++){
			canFilterConfig.FilterActivation = CAN_FILTER_DISABLE;
			canFilterConfig.FilterBank = i;
			HAL_CAN_ConfigFilter(&hcan1, &canFilterConfig);
		}
		canFilterConfig.FilterMode = 	CAN_FILTERMODE_IDMASK;
		canFilterConfig.FilterScale =  CAN_FILTERSCALE_32BIT;

		canFilterConfig.FilterMaskIdHigh = 0;
		canFilterConfig.FilterMaskIdLow = 0;

		canFilterConfig.FilterIdHigh = 0;
		canFilterConfig.FilterIdLow =  0;
		canFilterConfig.FilterActivation = CAN_FILTER_ENABLE;
		canFilterConfig.FilterBank = 14;

		
		HAL_CAN_ConfigFilter(&hcan1, &canFilterConfig);




}

//RFTP
FIL tftp_file_;
bool tftp_file_busy_ =false;
/**
   * Open file for read/write.
   * @param fname Filename
   * @param mode Mode string from TFTP RFC 1350 (netascii, octet, mail)
   * @param write Flag indicating read (0) or write (!= 0) access
   * @returns File handle supplied to other functions
   */
void* tftp_open_(const char* fname, const char* mode, u8_t write){
	UNUSED(mode);
	UNUSED(write);
	if(!tftp_file_busy_){
		if ( f_open(&tftp_file_, fname, write? (FA_WRITE | FA_CREATE_ALWAYS) :FA_READ) == FR_OK){			
			tftp_file_busy_ = true;
			return &tftp_file_;
		}
	}
	return 0;
}

void tftp_close_(void* handle){
	UNUSED(handle);
	if( tftp_file_busy_){
		f_close(&tftp_file_);
		tftp_file_busy_ = false;
	}
}

/**
 * Read from file 
 * @param handle File handle returned by open()
 * @param buf Target buffer to copy read data to
 * @param bytes Number of bytes to copy to buf
 * @returns &gt;= 0: Success; &lt; 0: Error
 */
int tftp_read_(void* handle, void* buf, int bytes){
	UNUSED(handle);
	UINT n;
	f_read(&tftp_file_, buf,(UINT)bytes, &n );
	return n;
}
 
/**
 * Write to file
 * @param handle File handle returned by open()
 * @param pbuf PBUF adjusted such that payload pointer points
 *             to the beginning of write data. In other words,
 *             TFTP headers are stripped off.
 * @returns &gt;= 0: Success; &lt; 0: Error
 */
int tftp_write_(void* handle, struct pbuf* p){
	int cnt = 0;
	while(p){
		UINT wrt = 0;
		if( f_write(&tftp_file_, p->payload, p->len, &wrt ) != FR_OK ){
			return -1;			
		}	
		cnt += wrt;		
		p=p->next;
	}
	return cnt;
}

bool tftp_init_(void){
	static	tftp_context tftp_context_ = {
		tftp_open_
		, tftp_close_
		, tftp_read_
		, tftp_write_
	};
	tftp_init( &tftp_context_ );
	return true;
}




