andrjus/omega-avatar-rev.1/content/app/central/source/platform/waveshare-stm32f407/avatar-central-perephery.cpp
//конфигурция файловой системы для K9F1G08 
#define NAND_PAGE_SIZE             ((uint16_t)0x0800) /* 2 * 1024 bytes per page w/o Spare Area */
#define NAND_BLOCK_SIZE            ((uint16_t)0x0040) /* 64 pages per block */
#define NAND_ZONE_SIZE             ((uint16_t)0x0400) /* 1024 Block per zone */
#define NAND_SPARE_AREA_SIZE       ((uint16_t)0x0040) /* last 64 bytes as spare area */
#define NAND_MAX_ZONE              ((uint16_t)0x0001) /* 1 zones of 1024 block */

static bool nand_file_test_(void){
	FIL testFile;
	f_open(&testFile, "test.txt", FA_READ);
	char buf[12];
	uint32_t rd;
	f_read(&testFile, buf,12,&rd);
	buf[rd] = 0;
	bool ret = (std::strcmp(buf,"Hello world")==0);
	f_close(&testFile);
	return ret;
}


bool nand_file_system_build_(void){
static 	BYTE work[_MAX_SS];
	f_mkfs (
		"A"	//-- Logical drive number 
		, FM_FAT //BYTE opt,			-- Format option 
		, NAND_PAGE_SIZE//		-- Size of allocation unit (cluster) [byte] 
		, work			//-- Pointer to working buffer 
		, _MAX_SS	//		-- Size of working buffer 
	);
	uint8_t nandPath[5] = "NAND";
	FATFS fileSystem;
	ROBO_LBREAKN_F( (f_mount(&fileSystem, (char *)nandPath, 0) == FR_OK), "file system  mount error" );
	FIL testFile;
	uint32_t rd;
	f_open(&testFile, "test.txt", FA_WRITE | FA_CREATE_ALWAYS);
	f_write(&testFile,"Hello world",11,&rd);
	f_close(&testFile);
	ROBO_LRET_F(nand_file_test_(), "file system run fault" );
}



bool nand_file_system_mount(void){
	static FATFS fileSystem;
	static uint8_t nandPath[5] = "NAND";
	ROBO_LBREAKN_F( (f_mount(&fileSystem, (char *)nandPath, 0) == FR_OK), "file system  mount error" );
	ROBO_LRET_F(nand_file_test_(), "file system run fault" );
}

int avatar_central_begin(void){

	transport_buffer * tmp = transport_buffers;
	for(int i=0;i<transport_buffers_count;++i,++tmp){
		transport_buffer_release(tmp);
	}
	ROBO_BREAKN( robo::app::machine::begin(AVATAR_INI_FILE, robo::termial::print),1 );
	//ROBO_BREAKN( robo::app::machine::begin("default-servo-2.ini"),1 );
	robo::app::machine::start();	
	return 0;
}
void avatar_central_finish(void){
	robo::app::machine::finish();	
}

void HAL_UART_TxCpltCallback(UART_HandleTypeDef *huart)
{
	if(huart==&huart4){
		avatar::dynamixel_TTL_channel::confirm();
	} else if(huart==&huart5){
		avatar::dynamixel_rs485_channel::confirm();
	}
}

void HAL_UART_RxCpltCallback(UART_HandleTypeDef *huart){
	if(huart==&huart4){
		avatar::dynamixel_TTL_channel::confirm();
	} else if(huart==&huart5){
		avatar::dynamixel_rs485_channel::confirm();
	}
	else if(huart==&huart3){
		if( UART3_BUFFER_COUNT<UART3_BUFFER_SIZE ){
			UART3_BUFFER_COUNT++;
			*pUART3_BUFFER++ = tmp_uart;
			if(tmp_uart == '\n'){
				UART3_BUFFER[UART3_BUFFER_COUNT]=0;
				pUART3_BUFFER = UART3_BUFFER;
				UART3_ACTUAL_SIZE = UART3_BUFFER_COUNT;
				UART3_BUFFER_COUNT = 0;
				//HAL_UART_Transmit_DMA(&huart3, UART3_BUFFER,UART3_ACTUAL_SIZE);
			}
		} else {
			pUART3_BUFFER = UART3_BUFFER;
			UART3_BUFFER_COUNT = 0;
		}
		UART_Start_Receive_IT(&huart3,&tmp_uart,1);
		//UART3_BUFFER[20]=0;
		//robo::system::printf(RT("%s"),UART3_BUFFER);
		//HAL_UARTEx_ReceiveToIdle_DMA(&huart3, UART3_BUFFER, UART3_BUFFER_SIZE);
		//HAL_UART_Transmit_DMA(&huart3, UART3_BUFFER, UART3_BUFFER_SIZE);
	}
}


/*
class uart0 :  public robo::net::iserial{
public:
			virtual robo_size_t available(void){
				return (huart3.Instance->SR & UART_FLAG_RXNE) == UART_FLAG_RXNE ? 1:0;
			}
			virtual robo_size_t space(void){
				return (huart3.Instance->SR & UART_FLAG_TC) == UART_FLAG_TC ? 1 : 0;
			}
			virtual robo_size_t get(robo_byte_p _data, robo_size_t _max_size){
				if(_max_size>0){
					*_data = (uint8_t) huart3.Instance->DR;
					return 1;
				}else{
					return 0;
				}
			
			virtual robo_result_t put(robo_byte_p _data, robo_size_t _size){
				if(_size == 1){
					huart3.Instance->DR = *_data ;
					return ROBO_SUCCESS;
				} else {
					return ROBO_ERROR;
				}
			}
			
			virtual uint8_t get(void){
					return (uint8_t) huart3.Instance->DR;
			}
			virtual robo_result_t  put(uint8_t _data){
				huart3.Instance->DR = _data;
				return ROBO_SUCCESS;
			}
			virtual void reset(void){
			}

} uart0_;
*/	

void HAL_UART_ErrorCallback(UART_HandleTypeDef *huart){
	if(huart==&huart4){
		avatar::dynamixel_TTL_channel::refuse();
	} else if(huart==&huart5){
		avatar::dynamixel_rs485_channel::refuse();
	}
}

void avatar_central_loop(void){
	if(! robo::app::machine::terminated() ) robo::app::machine::frontend_loop();
	transport_poll();
}

void HAL_CAN_TxMailbox0CompleteCallback(CAN_HandleTypeDef *hcan){
	avatar::CAN_channel::confirm();
}

void HAL_CAN_ErrorCallback(CAN_HandleTypeDef *hcan){
	avatar::CAN_channel::refuse();
	can_wait.reset();
}

void HAL_CAN_TxMailbox1AbortCallback(CAN_HandleTypeDef *hcan){
	avatar::CAN_channel::refuse();
	can_wait.reset();
}

void HAL_CAN_RxFifo0MsgPendingCallback(CAN_HandleTypeDef *hcan)
{
/*	static int trig = 0;
	static uint8_t RxData[8];
	board_flow_msg0_send(RxHeader.StdId|0x100, RxData, RxHeader.DLC);*/
	static CAN_RxHeaderTypeDef RxHeader;
	HAL_CAN_GetRxMessage(&hcan1, CAN_RX_FIFO0, &RxHeader, can_wait.data );
	if(RxHeader.StdId == can_wait.id && RxHeader.DLC == can_wait.count ){
		avatar::CAN_channel::confirm();
		can_wait.reset();
	}		
}


void HAL_TIM_PeriodElapsedCallback(TIM_HandleTypeDef *htim){
	HAL_GPIO_TogglePin(TEST_1_GPIO_Port,TEST_1_Pin);
	HAL_TIM_TriggerCallback(htim);
	if(! robo::app::machine::terminated() ) robo::app::machine::backend_loop();

}

void HAL_TIM_TriggerCallback(TIM_HandleTypeDef *htim){
	HAL_GPIO_TogglePin(TEST_2_GPIO_Port,TEST_2_Pin);
}


//заглушки
#ifndef SIO_DEFINED 
#include "sio.h"

sio_fd_t sio_open(u8_t devnum)
{
  return 0;
}

void sio_send(u8_t c, sio_fd_t fd){
	ROBO_UNUSED(c);
	ROBO_UNUSED(fd);
}

u32_t sio_read(sio_fd_t fd, u8_t *data, u32_t len)
{
	ROBO_UNUSED(fd);
	ROBO_UNUSED(data);
	ROBO_UNUSED(len);
  return 0;
}

u32_t sio_tryread(sio_fd_t fd, u8_t *data, u32_t len)
{
	ROBO_UNUSED(fd);
	ROBO_UNUSED(data);
	ROBO_UNUSED(len);  return 0;
}
#endif

//#include "net/robosd_net_master.hpp"

