andrjus/omega-avatar-rev.1/content/app/central/source/platform/waveshare-stm32f407/avatar-central-perephery.cpp
/*static int test_void2(void * _instance) {
		return *(int *)_instance + 1;
	}
	int instance;
	robo::delegat::suni<int> test_void_2_(&instance, test_void2);
*/

#if PERSISTENT_INI== 0

bool build_default_ini_(void){
	#ifdef LEFT_HAND
	static const robo::char_t buf[] =
		"[SETTINGS]\n"
		"DEBUG_VERB=6\n"
		"DEBUG_MASK_BITS=\"0 1 2 3\"\n"					
		"[MODULES]\n"
		"COUNT=1\n"
		"M_1=\"avatar\"\n"

		"[avatar]\n"
		"converter_count=8\n"
		"converter_1=z-1_position_co\n"
		"converter_2=yaw-2_position_co\n"
		"converter_3=yaw-3_position_co\n"
		"converter_4=roll-4_position_co\n"
		"converter_5=pitch-5_position_co\n"
		"converter_6=roll-6_position_co\n"
		"converter_7=grab-7_position_co\n"
		"converter_8=grab-8_position_co\n"
	
		"[z-1_position_co]\n"
		"min=110\n"
		"max=490\n"
		"offset=500\n"
		"scale=-256\n"

		"[yaw-2_position_co]\n"
		"min=-108\n"
		"max=98\n"
		"offset=-192\n"
		"scale=11.375\n"

		"[yaw-3_position_co]\n"
		"min=-170\n"
		"max=15\n"
		"offset=-334.5\n"
		"scale=11.375\n"
		
		"[roll-4_position_co]\n"
		"min=-89\n"
		"max=89\n"
		"offset=89.6\n"
		"scale=-22.766\n"

		"[pitch-5_position_co]\n"
		"min=-95\n"
		"max=80\n"
		"offset=-97.2\n"
		"scale=22.766\n"

		"[roll-6_position_co]\n"
		"min=-90\n"
		"max=90\n"
		"offset=222.2\n"
		"scale=-11.375\n"

		"[grab-7_position_co]\n"
		"min=0\n"
		"max=255\n"
		"offset=959.4\n"
		"scale=-3.725\n"

		"[grab-8_position_co]\n"
		"min=0\n"
		"max=255\n"
		"offset=777.1\n"
		"scale=-3.725\n"

		"[dynamixel_rs485_bus]\n"
		"BUS_ID=1\n"
		"DEFAULT_TIMEOUT_US=50000\n"
		
		"[dynamixel_TTL_bus]\n"
		"BUS_ID=2\n"
		"DEFAULT_TIMEOUT_US=5000\n"

		"[can8_bus]\n"
		"BUS_ID=3\n"
		"DEFAULT_TIMEOUT_US=5000\n"

		"[hand]\n"
		"REQUEST_PAUSE_US=100 #rx485 proto unswering after delay\n"

		"[grab]\n"
		"REQUEST_PAUSE_US=5000 #TTL proto unswering after delay\n"

		"[fake_router]\n"
		"ROUT_TABLE_SIZE=0\n"
		"#bus_id dev_id command request_suba abswer_suba\n"
		"RT_1=\"1 1 0 0 0\"\n"

		"[yaw-2]\n"
		"BOARD_DEV_ID=1\n"
		"ALIAS=\"yaw-2\"\n"
		"BUS_NAME=\"avatar/dynamixel_rs485_bus\"\n"
		"ROUTER_NAME=\"avatar/fake_router\"\n"
		"BOARD_DEV_ID=1\n"
		"BOARD_ADDRESS=0x02\n"		
		"ENABLED=1\n"		
		"calibrate_position=-14\n"
		"position_dead_zone=1\n"
		"speed_max=30\n"
		"position_converter=\"avatar/yaw-2_position_co\"\n"
		"homing_ofset=0\n"		

		"[yaw-3]\n"
		"BOARD_DEV_ID=1\n"
		"ALIAS=\"yaw-3\"\n"
		"BUS_NAME=\"avatar/dynamixel_rs485_bus\"\n"
		"ROUTER_NAME=\"avatar/fake_router\"\n"
		"BOARD_DEV_ID=1\n"
		"BOARD_ADDRESS=0x03\n"		
		"ENABLED=1\n"		
		"calibrate_position=-151\n"
		"position_dead_zone=1\n"
		"speed_max=30\n"
		"position_converter=\"avatar/yaw-3_position_co\"\n"
		"homing_ofset=0\n"		

		
		"[roll-4]\n"
		"BOARD_DEV_ID=1\n"
		"ALIAS=\"roll-4\"\n"
		"BUS_NAME=\"avatar/dynamixel_TTL_bus\"\n"
		"ROUTER_NAME=\"avatar/fake_router\"\n"
		"BOARD_DEV_ID=1\n"
		"BOARD_ADDRESS=0x02\n"		
		"ENABLED=1\n"		
		"calibrate_position=-88\n"
		"position_dead_zone=1\n"
		"speed_max=60\n"
		"position_converter=\"avatar/roll-4_position_co\"\n"
		"homing_ofset=0\n"		

		"[pitch-5]\n"
		"BOARD_DEV_ID=1\n"
		"ALIAS=\"pitch-5\"\n"
		"BUS_NAME=\"avatar/dynamixel_TTL_bus\"\n"
		"ROUTER_NAME=\"avatar/fake_router\"\n"
		"BOARD_DEV_ID=1\n"
		"BOARD_ADDRESS=0x03\n"		
		"ENABLED=1\n"		
		"calibrate_position=-88\n"
		"position_dead_zone=1\n"
		"speed_max=60\n"
		"position_converter=\"avatar/pitch-5_position_co\"\n"
		"homing_ofset=0\n"		

		"[roll-6]\n"
		"BOARD_DEV_ID=1\n"
		"ALIAS=\"roll-6\"\n"
		"BUS_NAME=\"avatar/dynamixel_TTL_bus\"\n"
		"ROUTER_NAME=\"avatar/fake_router\"\n"
		"BOARD_DEV_ID=1\n"
		"BOARD_ADDRESS=0x04\n"		
		"ENABLED=1\n"		
		"calibrate_position=82\n"
		"position_dead_zone=1\n"
		"speed_max=60\n"
		"position_converter=\"avatar/roll-6_position_co\"\n"
		"homing_ofset=0\n"		

		"[grab-7]\n"
		"BOARD_DEV_ID=1\n"
		"ALIAS=\"grab-7\"\n"
		"BUS_NAME=\"avatar/dynamixel_TTL_bus\"\n"
		"ROUTER_NAME=\"avatar/fake_router\"\n"
		"BOARD_DEV_ID=1\n"
		"BOARD_ADDRESS=0x05\n"		
		"ENABLED=1\n"		
		"calibrate_position=30\n"
		"position_dead_zone=1\n"
		"speed_max=60\n"
		"position_converter=\"avatar/grab-7_position_co\"\n"
		"homing_ofset=0\n"		

		"[grab-8]\n"
		"BOARD_DEV_ID=1\n"
		"ALIAS=\"grab-8\"\n"
		"BUS_NAME=\"avatar/dynamixel_TTL_bus\"\n"
		"ROUTER_NAME=\"avatar/fake_router\"\n"
		"BOARD_DEV_ID=1\n"
		"BOARD_ADDRESS=0x06\n"		
		"ENABLED=1\n"		
		"calibrate_position=30\n"
		"position_dead_zone=1\n"
		"speed_max=60\n"
		"position_converter=\"avatar/grab-8_position_co\"\n"
		"homing_ofset=0\n"		

		"[z-1]\n"
		"BOARD_DEV_ID=1\n"
		"ALIAS=\"Z\"\n"
		"BUS_NAME=\"avatar/can8_bus\"\n"
		"ROUTER_NAME=\"avatar/fake_router\"\n"
		"BOARD_DEV_ID=1\n"
		"BOARD_ADDRESS=0x01\n"		
		"ENABLED=1\n"
		"calibrate_position=250\n"
		"position_dead_zone=0.1\n"
		"speed_max=90\n"
		"position_converter=\"avatar/z-1_position_co\"\n"	
		"homing_ofset=0\n"		
	
		"[fingers]\n"
		"BOARD_DEV_ID=1\n"
		"ALIAS=\"FINGERS\"\n"
		"BUS_NAME=\"avatar/can8_bus\"\n"
		"ROUTER_NAME=\"avatar/fake_router\"\n"
		"BOARD_DEV_ID=1\n"
		"BOARD_ADDRESS=0x0E\n"		
		"ENABLED=0\n"
;
#endif

	FIL testFile;
	f_open(&testFile, AVATAR_INI_FILE, FA_WRITE | FA_CREATE_ALWAYS);
	uint32_t byteswritten;
	uint32_t bytes = strlen(buf);
	f_write (&testFile,buf, strlen(buf),&byteswritten);
	f_close(&testFile);
	ROBO_LRET_F(byteswritten == bytes,"build ini error");
}

void  encode( const char * _str);

void HAL_UARTEx_RxEventCallback(UART_HandleTypeDef *huart, uint16_t Size){
	if(huart==&huart3){
		//HAL_UARTEx_ReceiveToIdle_DMA(&huart3, UART3_BUFFER, UART3_BUFFER_SIZE);
		//UART3_BUFFER[Size]=0;
		//data_size_ = Size;
		//robo::system::printf(RT("%s"),UART3_BUFFER);
		//HAL_UART_Transmit_DMA(&huart3, UART3_BUFFER,Size);
		
	}
	
}
#endif

	struct content {		
		enum{key_sz = 20};
		struct {
			bool error = false;
			char key[key_sz];
			bool is_rot = false;
			bool is_pos = false;
			bool is_finger = false;		
			int finger_counter = 0;;
		} parse;

		char timestamp[key_sz];
		char cmd[key_sz];
		int arm =1;
		avatar::point point_;
		void do_encode_callback(
			struct jsonsl_state_st* state,
			const char* buf
		)
		{
			if (
				((state->special_flags & JSONSL_SPECIALf_UNSIGNED) == JSONSL_SPECIALf_UNSIGNED)
			||
				((state->special_flags & JSONSL_SPECIALf_UNSIGNED) == JSONSL_SPECIALf_UNSIGNED)
			||
				((state->special_flags & JSONSL_SPECIALf_FLOAT) == JSONSL_SPECIALf_FLOAT)
			||
				((state->special_flags & JSONSL_SPECIALf_EXPONENT) == JSONSL_SPECIALf_EXPONENT)
				)
			{
				const char* s = buf - (state->pos_cur - state->pos_begin);
					if (strcmp(parse.key, "arm") == 0) {
						arm = atoi(s);
					parse.key[0] = 0;
					} else
				if (strcmp(parse.key, "x") == 0) {
					if (parse.is_pos) {
						point_.pos.x = atof(s);
					}
					else {
						parse.error = true;
					}
					parse.key[0] = 0;

				} else 
				if (strcmp(parse.key, "y") == 0) {
					if (parse.is_pos) {
						point_.pos.y = atof(s);
					}
					else
						if (parse.is_rot) {
							point_.rot.y = atof(s);
						}
						else {
							parse.error = true;
						}
						parse.key[0] = 0;
				} else 
				if (strcmp(parse.key, "z") == 0) {
					if (parse.is_pos) {
						point_.pos.z = atof(s);
					}
					else {
						parse.error = true;
					}
					parse.key[0] = 0;
				} else
				if (strcmp(parse.key, "r") == 0) {
					if (parse.is_rot) {
						point_.rot.r = atof(s);
					}
					else {
						parse.error = true;
					}
					parse.key[0] = 0;
				} else 
				if (strcmp(parse.key, "p") == 0) {
					if (parse.is_rot) {
						point_.rot.p = atof(s);
					}
					else {
						parse.error = true;
					}
					parse.key[0] = 0;

				} else
				if (strcmp(parse.key, "fingers") == 0) {
					if (parse.finger_counter < 5) {
						parse.is_finger = true;
					}
					else {
						parse.key[0] = 0;
						parse.is_finger = false;
					}
					point_.fingers[parse.finger_counter++] = atof(s);
				}
			}

