andrjus/omega-avatar-rev.1/content/app/central/source/platform/waveshare-stm32f407/avatar-central-perephery.cpp
			switch (state->type) {
			case JSONSL_T_HKEY:
			case JSONSL_T_LIST:
			{
				const char* s = buf - (state->pos_cur - state->pos_begin) + 1;
				char* d = parse.key;
				for (int i = state->pos_begin + 1; i < state->pos_cur; ++i, ++s, ++d)	*d = *s;	*d = 0;
			}
			if (strcmp(parse.key, "pos") == 0) {
				parse.is_pos = true;
				parse.is_rot = false;
			}
			if (strcmp(parse.key, "rot") == 0) {
				parse.is_rot = true;
				parse.is_pos = false;
			}
			break;
			case JSONSL_T_STRING:
			{
				const char* s = buf - (state->pos_cur - state->pos_begin) + 1;
				char* d = nullptr;
				if (strcmp(parse.key, "timestamp") == 0) {
					 d = timestamp;
				}
				else if ( strcmp(parse.key, "command") ==0  ){
					d = cmd;
				} 
				if (d) {
					for (int i = state->pos_begin + 1; i < state->pos_cur; ++i, ++s, ++d) *d = *s;		*d = 0;
				}

				parse.key[0] = 0;

			}
				break;
			}
		}
		jsonsl_t parser;
		int error_callback_(
      jsonsl_error_t error,
      struct jsonsl_state_st* state,
      jsonsl_char_t *at){
				parse.error = true;
				return 0;
			}
		static void encode_callback(
			jsonsl_t jsn,
			jsonsl_action_t action,
			struct jsonsl_state_st* state,
			const char* buf);
		static int error_callback(jsonsl_t jsn,
        jsonsl_error_t error,
        struct jsonsl_state_st* state,
        jsonsl_char_t *at);
		content(void){
			parser =  jsonsl_new(100);
			parser->action_callback_POP = encode_callback;
			parser->error_callback = error_callback;
			jsonsl_enable_all_callbacks(parser);
		};
		~content(void){
			jsonsl_destroy(parser);
		}

			
	bool encode(const char* _buf, size_t _size) {
		parse.error = false;
		parse.key[0] = 0;
		parse.is_rot = false;
		parse.is_pos = false;
		parse.is_finger = false;		
		parse.finger_counter = 0;
		jsonsl_reset(parser);
		jsonsl_feed(parser, _buf, _size);
		
		return true;
	}
};
content content_;
void content::encode_callback(
			jsonsl_t jsn,
			jsonsl_action_t action,
			struct jsonsl_state_st* state,
			const char* buf){
	content_.do_encode_callback(state,buf);
}
int content::error_callback(jsonsl_t jsn,
        jsonsl_error_t error,
        struct jsonsl_state_st* state,
        jsonsl_char_t *at){
	return content_.error_callback_(error,state,at);
}

void send_status(void){
				avatar::status status;
				avatar::query_status(status);
				static robo::char_t answer[] = {
						"{"
							"\"command\": \"STATUS\","
							"\"timestamp\": \"%s\","
							"\"data\": {"
									"\"status\": \"%s\","
									"\"description\": \"%s\","
									"\"arm\": {"
										 "\"arm\": %d,"
										 "\"pos\": {"
													"\"x\": %2.2f,"
													 "\"y\": %2.2f,"
													 "\"z\": %2.2f"
										 "},"
										 "\"rot\": {"
													"\"r\": %2.2f,"
													"\"p\": %2.2f,"
													"\"y\": %2.2f,"
										 "},"
											"\"fingers\": [%2.2f, %2.2f, %2.2f, %2.2f, %2.2f]"
									"}"
							"}"
					"}\n"
				};
				static robo::cstr  status_names[ 9 ] = {
					RT("BOOTING")
					, RT("READY")
					, RT("NOT_CALIBRATED")
					, RT("CALIBRATING")
					,	RT("SHUTTING_DOWN")
					, RT("OFF = 5")
					, RT("MOVING")
					, RT("FAIL")
					, RT("ERROR")
				};
				int no = (int )status.state;
				size_t sz = robo::system::sprintf(
					(robo::char_t*)UART3_TX_BUFFER
					,UART3_BUFFER_SIZE
					,answer
					, content_.timestamp
					, status_names[no]
					,	RT("We're moving! Dhat's funny!")
					, 0 // arm
					, status.pt.pos.x
					, status.pt.pos.y
					, status.pt.pos.z
					, status.pt.rot.r
					, status.pt.rot.p
					, status.pt.rot.y
					, status.pt.fingers[0]
					, status.pt.fingers[1]
					, status.pt.fingers[2]
					, status.pt.fingers[3]
					, status.pt.fingers[4]
				);
				HAL_UART_Transmit_DMA(&huart3, UART3_TX_BUFFER,sz);	
}

void command_poll(void){
	size_t size;
	{
		robo::system::guard g__;
		size =  UART3_ACTUAL_SIZE;
		UART3_ACTUAL_SIZE = 0;
	}
	if(size>0){
		//за такое убивать на месте
		content_.encode((const char *)UART3_BUFFER,size);
		robo_detaillog(5,0,"%s",(const char *)UART3_BUFFER);
		if(!content_.parse.error){
			if( strcmp(content_.cmd,"STATUS") == 0 ){
				send_status();
			}else			if( strcmp(content_.cmd,"ARM") == 0 ){
				avatar::move_to(content_.point_);
			} else if( strcmp(content_.cmd,"CALIBRATE") == 0 ){				
				avatar::calibrate();
			} else if( strcmp(content_.cmd,"STOP") == 0 ){				
				avatar::stop();
			} else    if( strcmp(content_.cmd,"SHUTDOWN") == 0 ){	
				avatar::shutdown();					
			} else  if( strcmp(content_.cmd,"RESET") == 0 ){	
				avatar::reset();					
			} else  if( strcmp(content_.cmd,"REBOOT") == 0 ){	
					IWDG->KR = 0xCCCC; /* (1) */
					IWDG->KR = 0x5555; /* (2) */
					IWDG->PR = IWDG_PR_PR_1; /* (3) */
					IWDG->RLR = 0xFFF; /* (4) */
					while(IWDG->SR); /* (5) */
			}
		}
		send_status();
	}
	else{
		static robo::time_ms_t prev = 0;
		robo::time_ms_t ms = robo::system::env::time_ms();
		if( ms - prev > 1000 ){
			prev = ms;
			send_status();
		}
	}
}


bool avatar::save_state(uint32_t _res){
	FIL settingsFile;
	if( f_open(&settingsFile, "lastst.bin", FA_WRITE | FA_CREATE_ALWAYS) ==FR_OK){
		size_t byteswrite;
			struct {
			uint32_t flags;
			uint32_t data;
		} tmp;
		tmp.flags = 0x777;
		tmp.data = _res;
		if(f_write (&settingsFile,&tmp, 8,&byteswrite)==FR_OK){
			if(byteswrite==8){
				f_close(&settingsFile);
				return true;
			}
		}
		f_close(&settingsFile);
	}
	return false;
}
bool avatar::load_state(uint32_t & _dst){
	FIL settingsFile;
	if( f_open(&settingsFile, "lastst.bin", FA_READ) ==FR_OK){
		size_t bytesread;
		struct {
			uint32_t flags;
			uint32_t data;
		} tmp;
		if(f_read (&settingsFile,&tmp, 8,&bytesread)==FR_OK){
			if(bytesread==8){
				if(tmp.flags==0x777){
					_dst= tmp.data;
					f_close(&settingsFile);
					f_open(&settingsFile, "lastst.bin", FA_WRITE | FA_CREATE_ALWAYS);
					tmp.flags=0xFFEE;
					tmp.data=0x0000;
					f_write (&settingsFile,&tmp, 8,&bytesread);
					f_close(&settingsFile);
					return true;
				}
			}
		}
		f_close(&settingsFile);
	}
	return false;
}

			


//void command_poll(void){
//}